app/views/users/index.html.erb

            <td><%= user.email %></td>
            <td><%= Group.find(user.group_id).name %></td></td>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

            <td><%= f.email_field :email %></td>
            <td><%= f.select :group_id, Group.all.collect{|x| [x.name, x.id]}, {}, class: "multiple" %></td>
---
SELECT "groups".* FROM "groups"