app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "groups" SET "content" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["content", "<p>Hi %%%,</p>\r\n\r\n<p>alles Liebe zum Geburtstag!</p>\r\n\r\n<p>Jasper</p>"], ["updated_at", "2018-02-16 02:04:39.542067"], ["id", 6]]
---
  def update
    @group = Group.find(params[:id])
    if @group.update_attributes(group_params)

DELETE FROM "groups" WHERE "groups"."id" = ?  [["id", 3]]
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    Group.find(params[:id]).delete

INSERT INTO "groups" ("name", "subject", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "name"], ["subject", "naa"], ["content", "sdsd"], ["created_at", "2018-02-09 21:05:55.057484"], ["updated_at", "2018-02-09 21:05:55.057484"]]
---
  def create
    @group=Group.new(group_params)
    if @group.save