app/controllers/groups_controller.rb

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @group = Group.find(params[:id])