app/controllers/users_controller.rb

  def show
    @users = User.all
    @sortedUsers = @users.order(birthday: :desc)
---
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
SELECT "users".* FROM "users" ORDER BY "users"."birthday" DESC