app/controllers/users_controller.rb

  def index
    @users = User.all
    @sortedUsers = @users.order(birthday: :desc) ## :asc for ascending
    @user = User.new
    @groups = Group.all
---
SELECT "users".* FROM "users" ORDER BY "users"."birthday" DESC
SELECT "groups".* FROM "groups"

  def destroy
    User.find(params[:id]).delete
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 5]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO "users" ("firstname", "lastname", "email", "birthday", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["firstname", "hii"], ["lastname", "hwwww"], ["email", "mai@example.com"], ["birthday", "2018-01-01"], ["created_at", "2018-01-31 15:00:37.402319"], ["updated_at", "2018-01-31 15:00:37.402319"]]

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "email" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["email", "mail@examyple.com"], ["updated_at", "2018-02-08 18:57:45.225370"], ["id", 9]]